In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("Excel_data.xlsx")

In [3]:
print(df)

      ID      Name   Age         Profession  Salary
0      1    Olivia  23.0            Teacher  184518
1      2    Sophia  20.0              Boxer  119572
2      3      Jake  38.0          Scientist  174897
3      4     Rocky  56.0               Chef  117920
4      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [4]:
df.to_excel("xyz.xlsx")

In [5]:
df_csv = pd.read_csv("CSV_data.csv")

In [6]:
df_csv.to_csv("abc.csv")

In [7]:
df.head(10)

   ID    Name   Age Profession  Salary
0   1  Olivia  23.0    Teacher  184518
1   2  Sophia  20.0      Boxer  119572
2   3    Jake  38.0  Scientist  174897
3   4   Rocky  56.0       Chef  117920
4   4   Rocky  56.0       Chef  117920
5   4   Rocky  56.0       Chef  117920
6   4   Rocky  56.0       Chef  117920
7   4   Rocky  56.0       Chef  117920
8   4   Rocky  56.0       Chef  117920
9   4   Rocky  56.0       Chef  117920

In [8]:
df.tail(15)

      ID      Name   Age         Profession  Salary
485  486  Mr. Bean  59.0              Pilot  196562
486  487  Mr. Bean  23.0             Doctor  193209
487  488  Sherlock  49.0              Pilot   82386
488  489      Emma  21.0  Software Engineer   92013
489  490      John  56.0          Scientist   41192
490  491      John  57.0              Pilot  154180
491  492      Emma  34.0             Artist  145412
492  493      John  55.0             Artist   57720
493  494    Sophia  39.0             Doctor  174500
494  495     Rocky  27.0             Doctor   46975
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

In [9]:
df['Name']

0        Olivia
1        Sophia
2          Jake
3         Rocky
4         Rocky
         ...
495        John
496    Sherlock
497    Sherlock
498      Olivia
499    Sherlock
Name: Name, Length: 500, dtype: object

In [10]:
df.Name

0        Olivia
1        Sophia
2          Jake
3         Rocky
4         Rocky
         ...
495        John
496    Sherlock
497    Sherlock
498      Olivia
499    Sherlock
Name: Name, Length: 500, dtype: object

In [11]:
df[['ID','Salary']]

      ID  Salary
0      1  184518
1      2  119572
2      3  174897
3      4  117920
4      4  117920
..   ...     ...
495  496  137929
496  497   39870
497  498  165951
498  499  192618
499  500  194886

[500 rows x 2 columns]

In [12]:
# what is the difference between loc & iloc
df.head()

   ID    Name   Age Profession  Salary
0   1  Olivia  23.0    Teacher  184518
1   2  Sophia  20.0      Boxer  119572
2   3    Jake  38.0  Scientist  174897
3   4   Rocky  56.0       Chef  117920
4   4   Rocky  56.0       Chef  117920

In [13]:
df.loc[1:5, "Name" : "Profession"]

     Name   Age Profession
1  Sophia  20.0      Boxer
2    Jake  38.0  Scientist
3   Rocky  56.0       Chef
4   Rocky  56.0       Chef
5   Rocky  56.0       Chef

In [14]:
df.iloc[1:5, 1:4]

     Name   Age Profession
1  Sophia  20.0      Boxer
2    Jake  38.0  Scientist
3   Rocky  56.0       Chef
4   Rocky  56.0       Chef

In [15]:
df.iloc[2:5, [0,3]]

   ID Profession
2   3  Scientist
3   4       Chef
4   4       Chef

In [16]:
df.set_index("ID", inplace = True)
df.head()

      Name   Age Profession  Salary
ID
1   Olivia  23.0    Teacher  184518
2   Sophia  20.0      Boxer  119572
3     Jake  38.0  Scientist  174897
4    Rocky  56.0       Chef  117920
4    Rocky  56.0       Chef  117920

In [17]:
df.reset_index(inplace=True)

In [18]:
df.head()

   ID    Name   Age Profession  Salary
0   1  Olivia  23.0    Teacher  184518
1   2  Sophia  20.0      Boxer  119572
2   3    Jake  38.0  Scientist  174897
3   4   Rocky  56.0       Chef  117920
4   4   Rocky  56.0       Chef  117920

In [19]:
print(df)

      ID      Name   Age         Profession  Salary
0      1    Olivia  23.0            Teacher  184518
1      2    Sophia  20.0              Boxer  119572
2      3      Jake  38.0          Scientist  174897
3      4     Rocky  56.0               Chef  117920
4      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [20]:
df.shape

(500, 5)

In [21]:
df.dtypes

ID              int64
Name           object
Age           float64
Profession     object
Salary          int64
dtype: object

In [22]:
df['Name'] = df.Name.astype("string")

In [23]:
df.dtypes

ID                     int64
Name          string[python]
Age                  float64
Profession            object
Salary                 int64
dtype: object

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          500 non-null    int64
 1   Name        500 non-null    string
 2   Age         492 non-null    float64
 3   Profession  500 non-null    object
 4   Salary      500 non-null    int64
dtypes: float64(1), int64(2), object(1), string(1)
memory usage: 19.7+ KB

In [25]:
df.dtypes

ID                     int64
Name          string[python]
Age                  float64
Profession            object
Salary                 int64
dtype: object

In [26]:
df.describe()

               ID         Age         Salary
count  500.000000  492.000000     500.000000
mean   250.458000   40.810976  115602.828000
std    144.552978   11.790553   49404.366846
min      1.000000   20.000000   30164.000000
25%    125.750000   31.000000   74964.750000
50%    250.500000   40.500000  117920.000000
75%    375.250000   51.000000  160579.500000
max    500.000000   60.000000  199529.000000

In [27]:
df.isnull()

        ID   Name    Age  Profession  Salary
0    False  False  False       False   False
1    False  False  False       False   False
2    False  False  False       False   False
3    False  False  False       False   False
4    False  False  False       False   False
..     ...    ...    ...         ...     ...
495  False  False  False       False   False
496  False  False  False       False   False
497  False  False  False       False   False
498  False  False  False       False   False
499  False  False  False       False   False

[500 rows x 5 columns]

In [28]:
df.isnull().sum()

ID            0
Name          0
Age           8
Profession    0
Salary        0
dtype: int64

In [29]:
df1 = df.copy()

In [30]:
df1 = df1.dropna()

In [31]:
df1.isnull().sum()

ID            0
Name          0
Age           0
Profession    0
Salary        0
dtype: int64

In [32]:
df1.shape

(492, 5)

In [33]:
df1.dtypes

ID                     int64
Name          string[python]
Age                  float64
Profession            object
Salary                 int64
dtype: object

In [34]:
df1['Age'] = df1['Age'].astype(int)

In [35]:
df1.dtypes

ID                     int64
Name          string[python]
Age                    int32
Profession            object
Salary                 int64
dtype: object

In [36]:
df2 = df.copy()

In [37]:
df2 = df2.dropna(axis = 1, how = "any")

In [38]:
df2.dtypes

ID                     int64
Name          string[python]
Profession            object
Salary                 int64
dtype: object

# Replace a specific value

In [39]:
df4 = df.copy()

In [40]:
df4.head()

   ID    Name   Age Profession  Salary
0   1  Olivia  23.0    Teacher  184518
1   2  Sophia  20.0      Boxer  119572
2   3    Jake  38.0  Scientist  174897
3   4   Rocky  56.0       Chef  117920
4   4   Rocky  56.0       Chef  117920

In [41]:
df4["Name"] = df4.Name.replace("Olivia" , "Puneet")

In [42]:
df4.head()

   ID    Name   Age Profession  Salary
0   1  Puneet  23.0    Teacher  184518
1   2  Sophia  20.0      Boxer  119572
2   3    Jake  38.0  Scientist  174897
3   4   Rocky  56.0       Chef  117920
4   4   Rocky  56.0       Chef  117920

# Duplicate Values

In [44]:
df.duplicated()

0      False
1      False
2      False
3      False
4       True
       ...
495    False
496    False
497    False
498    False
499    False
Length: 500, dtype: bool

In [45]:
df.duplicated().sum()

6

In [46]:
df[df.duplicated()]

   ID   Name   Age Profession  Salary
4   4  Rocky  56.0       Chef  117920
5   4  Rocky  56.0       Chef  117920
6   4  Rocky  56.0       Chef  117920
7   4  Rocky  56.0       Chef  117920
8   4  Rocky  56.0       Chef  117920
9   4  Rocky  56.0       Chef  117920

In [47]:
df[df.duplicated(subset = ["Profession"])]

      ID      Name   Age         Profession  Salary
4      4     Rocky  56.0               Chef  117920
5      4     Rocky  56.0               Chef  117920
6      4     Rocky  56.0               Chef  117920
7      4     Rocky  56.0               Chef  117920
8      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

[490 rows x 5 columns]

In [48]:
df5 = df.copy()

In [49]:
df5 = df5.drop_duplicates()

In [51]:
df5[df5.duplicated()]

Empty DataFrame
Columns: [ID, Name, Age, Profession, Salary]
Index: []

In [52]:
df5 = df5.drop_duplicates(subset = ["Profession"])

In [54]:
df5.head(10)

    ID      Name   Age         Profession  Salary
0    1    Olivia  23.0            Teacher  184518
1    2    Sophia  20.0              Boxer  119572
2    3      Jake  38.0          Scientist  174897
3    4     Rocky  56.0               Chef  117920
10  11     Rocky   NaN             Doctor   75543
11  12      Jake   NaN             Artist  174780
12  13    Olivia  22.0           Comedian  102063
17  18      Jake  53.0  Software Engineer  127117
19  20  Sherlock  40.0          Detective  118998
26  27     Alice  48.0              Pilot   99949

# Aggregate column values

In [55]:
df['Salary'].sum()

57801414

In [56]:
df['Salary'].mean()

115602.828

In [57]:
df.groupby('Profession').sum()

,ID,Name,Age,Salary
Profession,,,,
Artist,9249,JakeJohnJakeMr. BeanMr. BeanSophiaEmmaJakeSoph...,1396.0,5106581
Boxer,13376,SophiaSherlockSherlockMr. BeanSherlockMr. Bean...,2096.0,5506481
Chef,12246,RockyRockyRockyRockyRockyRockyRockyJakeAliceAl...,2514.0,6426784
Comedian,13570,OliviaRockyOliviaMr. BeanSherlockOliviaJohnOli...,2082.0,6379828
Detective,11103,SherlockSherlockOliviaOliviaSophiaSherlockMr. ...,1825.0,5443424
Doctor,14287,RockyOliviaRockyOliviaLiamEmmaAliceAliceRockyR...,1985.0,5470288
Pilot,13480,AliceSherlockSherlockLiamLiamJakeMr. BeanEmmaS...,2065.0,5757998
Scientist,13665,JakeJohnJohnSherlockMr. BeanJohnAliceEmmaAlice...,2214.0,6840152
Software Engineer,13000,JakeJohnOliviaEmmaRockyEmmaSophiaRockyMr. Bean...,2056.0,6013356
Teacher,11253,OliviaAliceRockySophiaJakeMr. BeanJohnSherlock...,1846.0,4856522

# sort rows by values & index

In [60]:
df.sort_values('Age')

      ID      Name   Age         Profession  Salary
334  335      Emma  20.0          Detective   62711
1      2    Sophia  20.0              Boxer  119572
84    85    Olivia  20.0          Detective   51499
476  477  Sherlock  20.0               Chef  163029
457  458      John  20.0            Teacher  162705
..   ...       ...   ...                ...     ...
46    47  Mr. Bean   NaN             Artist  190559
71    72      Emma   NaN              Pilot   49986
72    73    Sophia   NaN             Artist   86741
73    74     Rocky   NaN  Software Engineer  159260
74    75  Sherlock   NaN          Detective  165463

[500 rows x 5 columns]

In [61]:
df.sort_index()

      ID      Name   Age         Profession  Salary
0      1    Olivia  23.0            Teacher  184518
1      2    Sophia  20.0              Boxer  119572
2      3      Jake  38.0          Scientist  174897
3      4     Rocky  56.0               Chef  117920
4      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [62]:
df['rank'] = df['Salary'].rank()

In [63]:
df.head()

   ID    Name   Age Profession  Salary   rank
0   1  Olivia  23.0    Teacher  184518  462.0
1   2  Sophia  20.0      Boxer  119572  267.0
2   3    Jake  38.0  Scientist  174897  426.0
3   4   Rocky  56.0       Chef  117920  251.0
4   4   Rocky  56.0       Chef  117920  251.0

# Apply function to Dataframe

In [64]:
df['Salary'] = df['Salary'].apply(lambda x : x*1.1)

In [65]:
df.head()

   ID    Name   Age Profession    Salary   rank
0   1  Olivia  23.0    Teacher  202969.8  462.0
1   2  Sophia  20.0      Boxer  131529.2  267.0
2   3    Jake  38.0  Scientist  192386.7  426.0
3   4   Rocky  56.0       Chef  129712.0  251.0
4   4   Rocky  56.0       Chef  129712.0  251.0

# Merge two DataFrames

In [67]:
df1 = pd.DataFrame({"ID" : [1,2,3] , 'Name' : ['Sumit' , 'Puneet', 'Rahul']} )

In [68]:
df2 = pd.DataFrame({"ID" : [2,3,4] , 'Score' : [85, 90, 95]} )

In [69]:
merge_df = pd.merge(df1, df2, on = 'ID')

In [70]:
print(merge_df)

   ID    Name  Score
0   2  Puneet     85
1   3   Rahul     90

In [71]:
print(df1)

   ID    Name
0   1   Sumit
1   2  Puneet
2   3   Rahul

In [72]:
print(df2)

   ID  Score
0   2     85
1   3     90
2   4     95

In [73]:
merge_df = pd.merge(df1, df2, on = 'ID', how = 'left')
print(merge_df)

   ID    Name  Score
0   1   Sumit    NaN
1   2  Puneet   85.0
2   3   Rahul   90.0